; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f8-p19-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 p16 p17 p18 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)

(above f4 f5)
(above f4 f6)
(above f4 f7)

(above f5 f6)
(above f5 f7)

(above f6 f7)



(origin p0 f4)
(destin p0 f0)

(origin p1 f1)
(destin p1 f7)

(origin p2 f2)
(destin p2 f6)

(origin p3 f4)
(destin p3 f7)

(origin p4 f6)
(destin p4 f4)

(origin p5 f1)
(destin p5 f7)

(origin p6 f3)
(destin p6 f0)

(origin p7 f1)
(destin p7 f5)

(origin p8 f5)
(destin p8 f4)

(origin p9 f1)
(destin p9 f6)

(origin p10 f3)
(destin p10 f0)

(origin p11 f7)
(destin p11 f4)

(origin p12 f6)
(destin p12 f3)

(origin p13 f6)
(destin p13 f1)

(origin p14 f6)
(destin p14 f0)

(origin p15 f5)
(destin p15 f7)

(origin p16 f1)
(destin p16 f4)

(origin p17 f1)
(destin p17 f7)

(origin p18 f0)
(destin p18 f5)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
(served p16)
(served p17)
(served p18)
))
)

; plan
1. (up f0 f6)
   deleted: (lift-at f0)
   added: (lift-at f6)
   goals met: 0 of 19
2. (board f6 p14)
   added: (boarded p14)
   goals met: 0 of 19
3. (board f6 p13)
   added: (boarded p13)
   goals met: 0 of 19
4. (board f6 p12)
   added: (boarded p12)
   goals met: 0 of 19
5. (down f6 f4)
   deleted: (lift-at f6)
   added: (lift-at f4)
   goals met: 0 of 19
6. (board f4 p3)
   added: (boarded p3)
   goals met: 0 of 19
7. (board f4 p0)
   added: (boarded p0)
   goals met: 0 of 19
8. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 0 of 19
9. (depart f3 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 1 of 19
10. (board f3 p6)
   added: (boarded p6)
   goals met: 1 of 19
11. (board f3 p10)
   added: (boarded p10)
   goals met: 1 of 19
12. (down f3 f0)
   deleted: (lift-at f3)
   added: (lift-at f0)
   goals met: 1 of 19
13. (depart f0 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 2 of 19
14. (depart f0 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 3 of 19
15. (board f0 p18)
   added: (boarded p18)
   goals met: 3 of 19
16. (depart f0 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 4 of 19
17. (depart f0 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 5 of 19
18. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 5 of 19
19. (board f1 p1)
   added: (boarded p1)
   goals met: 5 of 19
20. (board f1 p16)
   added: (boarded p16)
   goals met: 5 of 19
21. (board f1 p17)
   added: (boarded p17)
   goals met: 5 of 19
22. (board f1 p5)
   added: (boarded p5)
   goals met: 5 of 19
23. (board f1 p7)
   added: (boarded p7)
   goals met: 5 of 19
24. (board f1 p9)
   added: (boarded p9)
   goals met: 5 of 19
25. (depart f1 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 6 of 19
26. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 6 of 19
27. (board f2 p2)
   added: (boarded p2)
   goals met: 6 of 19
28. (up f2 f5)
   deleted: (lift-at f2)
   added: (lift-at f5)
   goals met: 6 of 19
29. (board f5 p15)
   added: (boarded p15)
   goals met: 6 of 19
30. (board f5 p8)
   added: (boarded p8)
   goals met: 6 of 19
31. (depart f5 p18)
   deleted: (boarded p18)
   added: (served p18)
   goals met: 7 of 19
32. (depart f5 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 8 of 19
33. (up f5 f6)
   deleted: (lift-at f5)
   added: (lift-at f6)
   goals met: 8 of 19
34. (board f6 p4)
   added: (boarded p4)
   goals met: 8 of 19
35. (depart f6 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 9 of 19
36. (depart f6 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 10 of 19
37. (up f6 f7)
   deleted: (lift-at f6)
   added: (lift-at f7)
   goals met: 10 of 19
38. (board f7 p11)
   added: (boarded p11)
   goals met: 10 of 19
39. (depart f7 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 11 of 19
40. (depart f7 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 12 of 19
41. (depart f7 p17)
   deleted: (boarded p17)
   added: (served p17)
   goals met: 13 of 19
42. (depart f7 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 14 of 19
43. (depart f7 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 15 of 19
44. (down f7 f4)
   deleted: (lift-at f7)
   added: (lift-at f4)
   goals met: 15 of 19
45. (depart f4 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 16 of 19
46. (depart f4 p16)
   deleted: (boarded p16)
   added: (served p16)
   goals met: 17 of 19
47. (depart f4 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 18 of 19
48. (depart f4 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 19 of 19
